In [1]:
from sklearn.datasets import fetch_openml

In [2]:
titanic = fetch_openml("titanic",version = 1, as_frame = True)
df = titanic.data

In [3]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [4]:
df["survived"] = titanic["target"]

In [5]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,0
1305,3,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,0
1306,3,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,0
1307,3,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,0
1308,3,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,0

In [6]:
df.drop(["name","sibsp","parch","cabin","boat","home.dest"],axis=1,inplace=True)

In [7]:
df

      pclass     sex      age  ticket      fare embarked   body survived
0          1  female  29.0000   24160  211.3375        S    NaN        1
1          1    male   0.9167  113781  151.5500        S    NaN        1
2          1  female   2.0000  113781  151.5500        S    NaN        0
3          1    male  30.0000  113781  151.5500        S  135.0        0
4          1  female  25.0000  113781  151.5500        S    NaN        0
...      ...     ...      ...     ...       ...      ...    ...      ...
1304       3  female  14.5000    2665   14.4542        C  328.0        0
1305       3  female      NaN    2665   14.4542        C    NaN        0
1306       3    male  26.5000    2656    7.2250        C  304.0        0
1307       3    male  27.0000    2670    7.2250        C    NaN        0
1308       3    male  29.0000  315082    7.8750        S    NaN        0

[1309 rows x 8 columns]

In [8]:
from sklearn.impute import SimpleImputer

def parameter(df):
    for col in df.columns[df.isnull().any()]:
        if df[col].dtype == "int64" or df[col].dtype == "float64":
            strategy = "mean"
        else:
            strategy = "most_frequent"
        
        imp = SimpleImputer(strategy = strategy)
        df[[col]] = imp.fit_transform(df[[col]])

In [9]:
parameter(df)

In [10]:
df.isnull().sum()

pclass      0
sex         0
age         0
ticket      0
fare        0
embarked    0
body        0
survived    0
dtype: int64

In [11]:
df

,pclass,sex,age,ticket,fare,embarked,body,survived
0,1,female,29.000000,24160,211.3375,S,160.809917,1
1,1,male,0.916700,113781,151.5500,S,160.809917,1
2,1,female,2.000000,113781,151.5500,S,160.809917,0
3,1,male,30.000000,113781,151.5500,S,135.000000,0
4,1,female,25.000000,113781,151.5500,S,160.809917,0
...,...,...,...,...,...,...,...,...
1304,3,female,14.500000,2665,14.4542,C,328.000000,0
1305,3,female,29.881135,2665,14.4542,C,160.809917,0
1306,3,male,26.500000,2656,7.2250,C,304.000000,0
1307,3,male,27.000000,2670,7.2250,C,160.809917,0
1308,3,male,29.000000,315082,7.8750,S,160.809917,0